lxl-git05/TI_MSPM0/Template/ti_msp_dl_config.h
/*
 * Copyright (c) 2023, Texas Instruments Incorporated - http://www.ti.com
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/*
 *  ============ ti_msp_dl_config.h =============
 *  Configured MSPM0 DriverLib module declarations
 *
 *  DO NOT EDIT - This file is generated for the MSPM0G350X
 *  by the SysConfig tool.
 */
#ifndef ti_msp_dl_config_h
#define ti_msp_dl_config_h

#define CONFIG_MSPM0G350X
#define CONFIG_MSPM0G3507

#if defined(__ti_version__) || defined(__TI_COMPILER_VERSION__)
#define SYSCONFIG_WEAK __attribute__((weak))
#elif defined(__IAR_SYSTEMS_ICC__)
#define SYSCONFIG_WEAK __weak
#elif defined(__GNUC__)
#define SYSCONFIG_WEAK __attribute__((weak))
#endif

#include <ti/devices/msp/msp.h>
#include <ti/driverlib/driverlib.h>
#include <ti/driverlib/m0p/dl_core.h>

#ifdef __cplusplus
extern "C" {
#endif

/*
 *  ======== SYSCFG_DL_init ========
 *  Perform all required MSP DL initialization
 *
 *  This function should be called once at a point before any use of
 *  MSP DL.
 */


/* clang-format off */

#define POWER_STARTUP_DELAY                                                (16)


#define CPUCLK_FREQ                                                     32000000



/* Defines for PWM_MOTOR_PWM */
#define PWM_MOTOR_PWM_INST                                                 TIMA1
#define PWM_MOTOR_PWM_INST_IRQHandler                           TIMA1_IRQHandler
#define PWM_MOTOR_PWM_INST_INT_IRQN                             (TIMA1_INT_IRQn)
#define PWM_MOTOR_PWM_INST_CLK_FREQ                                      4000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_MOTOR_PWM_C0_PORT                                         GPIOB
#define GPIO_PWM_MOTOR_PWM_C0_PIN                                  DL_GPIO_PIN_4
#define GPIO_PWM_MOTOR_PWM_C0_IOMUX                              (IOMUX_PINCM17)
#define GPIO_PWM_MOTOR_PWM_C0_IOMUX_FUNC             IOMUX_PINCM17_PF_TIMA1_CCP0
#define GPIO_PWM_MOTOR_PWM_C0_IDX                            DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_MOTOR_PWM_C1_PORT                                         GPIOB
#define GPIO_PWM_MOTOR_PWM_C1_PIN                                  DL_GPIO_PIN_5
#define GPIO_PWM_MOTOR_PWM_C1_IOMUX                              (IOMUX_PINCM18)
#define GPIO_PWM_MOTOR_PWM_C1_IOMUX_FUNC             IOMUX_PINCM18_PF_TIMA1_CCP1
#define GPIO_PWM_MOTOR_PWM_C1_IDX                            DL_TIMER_CC_1_INDEX

/* Defines for PWM_Stepper1 */
#define PWM_Stepper1_INST                                                  TIMG6
#define PWM_Stepper1_INST_IRQHandler                            TIMG6_IRQHandler
#define PWM_Stepper1_INST_INT_IRQN                              (TIMG6_INT_IRQn)
#define PWM_Stepper1_INST_CLK_FREQ                                      32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_Stepper1_C0_PORT                                          GPIOA
#define GPIO_PWM_Stepper1_C0_PIN                                  DL_GPIO_PIN_21
#define GPIO_PWM_Stepper1_C0_IOMUX                               (IOMUX_PINCM46)
#define GPIO_PWM_Stepper1_C0_IOMUX_FUNC              IOMUX_PINCM46_PF_TIMG6_CCP0
#define GPIO_PWM_Stepper1_C0_IDX                             DL_TIMER_CC_0_INDEX

/* Defines for PWM_Stepper2 */
#define PWM_Stepper2_INST                                                  TIMG7
#define PWM_Stepper2_INST_IRQHandler                            TIMG7_IRQHandler
#define PWM_Stepper2_INST_INT_IRQN                              (TIMG7_INT_IRQn)
#define PWM_Stepper2_INST_CLK_FREQ                                      32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_Stepper2_C0_PORT                                          GPIOA
#define GPIO_PWM_Stepper2_C0_PIN                                  DL_GPIO_PIN_23
#define GPIO_PWM_Stepper2_C0_IOMUX                               (IOMUX_PINCM53)
#define GPIO_PWM_Stepper2_C0_IOMUX_FUNC              IOMUX_PINCM53_PF_TIMG7_CCP0
#define GPIO_PWM_Stepper2_C0_IDX                             DL_TIMER_CC_0_INDEX

/* Defines for PWM_Servo */
#define PWM_Servo_INST                                                     TIMG8
#define PWM_Servo_INST_IRQHandler                               TIMG8_IRQHandler
#define PWM_Servo_INST_INT_IRQN                                 (TIMG8_INT_IRQn)
#define PWM_Servo_INST_CLK_FREQ                                         32000000
/* GPIO defines for channel 0 */
#define GPIO_PWM_Servo_C0_PORT                                             GPIOA
#define GPIO_PWM_Servo_C0_PIN                                     DL_GPIO_PIN_29
#define GPIO_PWM_Servo_C0_IOMUX                                   (IOMUX_PINCM4)
#define GPIO_PWM_Servo_C0_IOMUX_FUNC                  IOMUX_PINCM4_PF_TIMG8_CCP0
#define GPIO_PWM_Servo_C0_IDX                                DL_TIMER_CC_0_INDEX
/* GPIO defines for channel 1 */
#define GPIO_PWM_Servo_C1_PORT                                             GPIOA
#define GPIO_PWM_Servo_C1_PIN                                      DL_GPIO_PIN_2
#define GPIO_PWM_Servo_C1_IOMUX                                   (IOMUX_PINCM7)
#define GPIO_PWM_Servo_C1_IOMUX_FUNC                  IOMUX_PINCM7_PF_TIMG8_CCP1
#define GPIO_PWM_Servo_C1_IDX                                DL_TIMER_CC_1_INDEX



/* Defines for TIMER_0 */
#define TIMER_0_INST                                                     (TIMG0)
#define TIMER_0_INST_IRQHandler                                 TIMG0_IRQHandler
#define TIMER_0_INST_INT_IRQN                                   (TIMG0_INT_IRQn)
#define TIMER_0_INST_LOAD_VALUE                                         (31999U)
/* Defines for TIMER_1 */
#define TIMER_1_INST                                                     (TIMA0)
#define TIMER_1_INST_IRQHandler                                 TIMA0_IRQHandler
#define TIMER_1_INST_INT_IRQN                                   (TIMA0_INT_IRQn)
#define TIMER_1_INST_LOAD_VALUE                                           (799U)
/* Defines for TIMER_2 */
#define TIMER_2_INST                                                    (TIMG12)
#define TIMER_2_INST_IRQHandler                                TIMG12_IRQHandler
#define TIMER_2_INST_INT_IRQN                                  (TIMG12_INT_IRQn)
#define TIMER_2_INST_LOAD_VALUE                                          (3999U)




/* Defines for I2C_0 */
#define I2C_0_INST                                                          I2C0
#define I2C_0_INST_IRQHandler                                    I2C0_IRQHandler
#define I2C_0_INST_INT_IRQN                                        I2C0_INT_IRQn
#define I2C_0_BUS_SPEED_HZ                                                400000
#define GPIO_I2C_0_SDA_PORT                                                GPIOA
#define GPIO_I2C_0_SDA_PIN                                         DL_GPIO_PIN_0
#define GPIO_I2C_0_IOMUX_SDA                                      (IOMUX_PINCM1)
#define GPIO_I2C_0_IOMUX_SDA_FUNC                       IOMUX_PINCM1_PF_I2C0_SDA
#define GPIO_I2C_0_SCL_PORT                                                GPIOA
#define GPIO_I2C_0_SCL_PIN                                         DL_GPIO_PIN_1
#define GPIO_I2C_0_IOMUX_SCL                                      (IOMUX_PINCM2)
#define GPIO_I2C_0_IOMUX_SCL_FUNC                       IOMUX_PINCM2_PF_I2C0_SCL

/* Defines for I2C_1 */
#define I2C_1_INST                                                          I2C1
#define I2C_1_INST_IRQHandler                                    I2C1_IRQHandler
#define I2C_1_INST_INT_IRQN                                        I2C1_INT_IRQn
#define I2C_1_BUS_SPEED_HZ                                                400000
#define GPIO_I2C_1_SDA_PORT                                                GPIOB
#define GPIO_I2C_1_SDA_PIN                                         DL_GPIO_PIN_3
#define GPIO_I2C_1_IOMUX_SDA                                     (IOMUX_PINCM16)
#define GPIO_I2C_1_IOMUX_SDA_FUNC                      IOMUX_PINCM16_PF_I2C1_SDA
#define GPIO_I2C_1_SCL_PORT                                                GPIOB
#define GPIO_I2C_1_SCL_PIN                                         DL_GPIO_PIN_2
#define GPIO_I2C_1_IOMUX_SCL                                     (IOMUX_PINCM15)
#define GPIO_I2C_1_IOMUX_SCL_FUNC                      IOMUX_PINCM15_PF_I2C1_SCL


/* Defines for UART_0 */
#define UART_0_INST                                                        UART0
#define UART_0_INST_FREQUENCY                                           32000000
#define UART_0_INST_IRQHandler                                  UART0_IRQHandler
#define UART_0_INST_INT_IRQN                                      UART0_INT_IRQn
#define GPIO_UART_0_RX_PORT                                                GPIOA
#define GPIO_UART_0_TX_PORT                                                GPIOA
#define GPIO_UART_0_RX_PIN                                        DL_GPIO_PIN_11
#define GPIO_UART_0_TX_PIN                                        DL_GPIO_PIN_10
#define GPIO_UART_0_IOMUX_RX                                     (IOMUX_PINCM22)
#define GPIO_UART_0_IOMUX_TX                                     (IOMUX_PINCM21)
#define GPIO_UART_0_IOMUX_RX_FUNC                      IOMUX_PINCM22_PF_UART0_RX
#define GPIO_UART_0_IOMUX_TX_FUNC                      IOMUX_PINCM21_PF_UART0_TX
#define UART_0_BAUD_RATE                                                (115200)
#define UART_0_IBRD_32_MHZ_115200_BAUD                                      (17)
#define UART_0_FBRD_32_MHZ_115200_BAUD                                      (23)
/* Defines for UART_1 */
#define UART_1_INST                                                        UART1
#define UART_1_INST_FREQUENCY                                           32000000
#define UART_1_INST_IRQHandler                                  UART1_IRQHandler
#define UART_1_INST_INT_IRQN                                      UART1_INT_IRQn
#define GPIO_UART_1_RX_PORT                                                GPIOA
#define GPIO_UART_1_TX_PORT                                                GPIOA
#define GPIO_UART_1_RX_PIN                                         DL_GPIO_PIN_9
#define GPIO_UART_1_TX_PIN                                         DL_GPIO_PIN_8
#define GPIO_UART_1_IOMUX_RX                                     (IOMUX_PINCM20)
#define GPIO_UART_1_IOMUX_TX                                     (IOMUX_PINCM19)
#define GPIO_UART_1_IOMUX_RX_FUNC                      IOMUX_PINCM20_PF_UART1_RX
#define GPIO_UART_1_IOMUX_TX_FUNC                      IOMUX_PINCM19_PF_UART1_TX
#define UART_1_BAUD_RATE                                                 (38400)
#define UART_1_IBRD_32_MHZ_38400_BAUD                                       (52)
#define UART_1_FBRD_32_MHZ_38400_BAUD                                        (5)
/* Defines for UART_2 */
#define UART_2_INST                                                        UART2
#define UART_2_INST_FREQUENCY                                           32000000
#define UART_2_INST_IRQHandler                                  UART2_IRQHandler
#define UART_2_INST_INT_IRQN                                      UART2_INT_IRQn
#define GPIO_UART_2_RX_PORT                                                GPIOB
#define GPIO_UART_2_TX_PORT                                                GPIOB
#define GPIO_UART_2_RX_PIN                                        DL_GPIO_PIN_16
#define GPIO_UART_2_TX_PIN                                        DL_GPIO_PIN_15
#define GPIO_UART_2_IOMUX_RX                                     (IOMUX_PINCM33)
#define GPIO_UART_2_IOMUX_TX                                     (IOMUX_PINCM32)
#define GPIO_UART_2_IOMUX_RX_FUNC                      IOMUX_PINCM33_PF_UART2_RX
#define GPIO_UART_2_IOMUX_TX_FUNC                      IOMUX_PINCM32_PF_UART2_TX
#define UART_2_BAUD_RATE                                                (115200)
#define UART_2_IBRD_32_MHZ_115200_BAUD                                      (17)
#define UART_2_FBRD_32_MHZ_115200_BAUD                                      (23)
/* Defines for UART_4 */
#define UART_4_INST                                                        UART3
#define UART_4_INST_FREQUENCY                                           32000000
#define UART_4_INST_IRQHandler                                  UART3_IRQHandler
#define UART_4_INST_INT_IRQN                                      UART3_INT_IRQn
#define GPIO_UART_4_RX_PORT                                                GPIOA
#define GPIO_UART_4_TX_PORT                                                GPIOA
#define GPIO_UART_4_RX_PIN                                        DL_GPIO_PIN_25
#define GPIO_UART_4_TX_PIN                                        DL_GPIO_PIN_26
#define GPIO_UART_4_IOMUX_RX                                     (IOMUX_PINCM55)
#define GPIO_UART_4_IOMUX_TX                                     (IOMUX_PINCM59)
#define GPIO_UART_4_IOMUX_RX_FUNC                      IOMUX_PINCM55_PF_UART3_RX
#define GPIO_UART_4_IOMUX_TX_FUNC                      IOMUX_PINCM59_PF_UART3_TX
#define UART_4_BAUD_RATE                                                (115200)
#define UART_4_IBRD_32_MHZ_115200_BAUD                                      (17)
#define UART_4_FBRD_32_MHZ_115200_BAUD                                      (23)





