lxl-git05/TI_MSPM0/Template/ti_msp_dl_config.h
/* Defines for DMA_UART_0_RX_Channel */
#define DMA_UART_0_RX_Channel_CHAN_ID                                        (1)
#define UART_0_INST_DMA_TRIGGER_0                            (DMA_UART0_RX_TRIG)
/* Defines for DMA_UART_0_TX_Channel */
#define DMA_UART_0_TX_Channel_CHAN_ID                                        (0)
#define UART_0_INST_DMA_TRIGGER_1                            (DMA_UART0_TX_TRIG)


/* Port definition for Pin Group GPIO_TCRT */
#define GPIO_TCRT_PORT                                                   (GPIOA)

/* Defines for TCRT_0: GPIOA.13 with pinCMx 35 on package pin 6 */
#define GPIO_TCRT_TCRT_0_PIN                                    (DL_GPIO_PIN_13)
#define GPIO_TCRT_TCRT_0_IOMUX                                   (IOMUX_PINCM35)
/* Port definition for Pin Group GPIO_Buzzer */
#define GPIO_Buzzer_PORT                                                 (GPIOB)

/* Defines for PIN_Buzzer: GPIOB.23 with pinCMx 51 on package pin 22 */
#define GPIO_Buzzer_PIN_Buzzer_PIN                              (DL_GPIO_PIN_23)
#define GPIO_Buzzer_PIN_Buzzer_IOMUX                             (IOMUX_PINCM51)
/* Port definition for Pin Group GPIO_Elec */
#define GPIO_Elec_PORT                                                   (GPIOB)

/* Defines for PIN_Elec: GPIOB.24 with pinCMx 52 on package pin 23 */
#define GPIO_Elec_PIN_Elec_PIN                                  (DL_GPIO_PIN_24)
#define GPIO_Elec_PIN_Elec_IOMUX                                 (IOMUX_PINCM52)
/* Port definition for Pin Group GPIO_LED */
#define GPIO_LED_PORT                                                    (GPIOB)

/* Defines for LED_PIN_0: GPIOB.22 with pinCMx 50 on package pin 21 */
#define GPIO_LED_LED_PIN_0_PIN                                  (DL_GPIO_PIN_22)
#define GPIO_LED_LED_PIN_0_IOMUX                                 (IOMUX_PINCM50)
/* Defines for LED_Time: GPIOB.9 with pinCMx 26 on package pin 61 */
#define GPIO_LED_LED_Time_PIN                                    (DL_GPIO_PIN_9)
#define GPIO_LED_LED_Time_IOMUX                                  (IOMUX_PINCM26)
/* Defines for KEY_0: GPIOB.21 with pinCMx 49 on package pin 20 */
#define GPIO_KEY_KEY_0_PORT                                              (GPIOB)
#define GPIO_KEY_KEY_0_PIN                                      (DL_GPIO_PIN_21)
#define GPIO_KEY_KEY_0_IOMUX                                     (IOMUX_PINCM49)
/* Defines for KEY_1: GPIOA.15 with pinCMx 37 on package pin 8 */
#define GPIO_KEY_KEY_1_PORT                                              (GPIOA)
#define GPIO_KEY_KEY_1_PIN                                      (DL_GPIO_PIN_15)
#define GPIO_KEY_KEY_1_IOMUX                                     (IOMUX_PINCM37)
/* Defines for KEY_2: GPIOA.17 with pinCMx 39 on package pin 10 */
#define GPIO_KEY_KEY_2_PORT                                              (GPIOA)
#define GPIO_KEY_KEY_2_PIN                                      (DL_GPIO_PIN_17)
#define GPIO_KEY_KEY_2_IOMUX                                     (IOMUX_PINCM39)
/* Port definition for Pin Group GPIO_OLED */
#define GPIO_OLED_PORT                                                   (GPIOA)

/* Defines for OLED_SCL: GPIOA.31 with pinCMx 6 on package pin 39 */
#define GPIO_OLED_OLED_SCL_PIN                                  (DL_GPIO_PIN_31)
#define GPIO_OLED_OLED_SCL_IOMUX                                  (IOMUX_PINCM6)
/* Defines for OLED_SDA: GPIOA.28 with pinCMx 3 on package pin 35 */
#define GPIO_OLED_OLED_SDA_PIN                                  (DL_GPIO_PIN_28)
#define GPIO_OLED_OLED_SDA_IOMUX                                  (IOMUX_PINCM3)
/* Port definition for Pin Group GPIO_ENCODER_A */
#define GPIO_ENCODER_A_PORT                                              (GPIOB)

/* Defines for A_Encoder_1: GPIOB.14 with pinCMx 31 on package pin 2 */
// groups represented: ["GPIO_ENCODER_B","GPIO_ENCODER_A"]
// pins affected: ["B_Encoder_1","A_Encoder_1"]
#define GPIO_MULTIPLE_GPIOB_INT_IRQN                            (GPIOB_INT_IRQn)
#define GPIO_MULTIPLE_GPIOB_INT_IIDX            (DL_INTERRUPT_GROUP1_IIDX_GPIOB)
#define GPIO_ENCODER_A_A_Encoder_1_IIDX                     (DL_GPIO_IIDX_DIO14)
#define GPIO_ENCODER_A_A_Encoder_1_PIN                          (DL_GPIO_PIN_14)
#define GPIO_ENCODER_A_A_Encoder_1_IOMUX                         (IOMUX_PINCM31)
/* Defines for A_Encoder_2: GPIOB.1 with pinCMx 13 on package pin 48 */
#define GPIO_ENCODER_A_A_Encoder_2_PIN                           (DL_GPIO_PIN_1)
#define GPIO_ENCODER_A_A_Encoder_2_IOMUX                         (IOMUX_PINCM13)
/* Port definition for Pin Group GPIO_ENCODER_B */
#define GPIO_ENCODER_B_PORT                                              (GPIOB)

/* Defines for B_Encoder_1: GPIOB.11 with pinCMx 28 on package pin 63 */
#define GPIO_ENCODER_B_B_Encoder_1_IIDX                     (DL_GPIO_IIDX_DIO11)
#define GPIO_ENCODER_B_B_Encoder_1_PIN                          (DL_GPIO_PIN_11)
#define GPIO_ENCODER_B_B_Encoder_1_IOMUX                         (IOMUX_PINCM28)
/* Defines for B_Encoder_2: GPIOB.10 with pinCMx 27 on package pin 62 */
#define GPIO_ENCODER_B_B_Encoder_2_PIN                          (DL_GPIO_PIN_10)
#define GPIO_ENCODER_B_B_Encoder_2_IOMUX                         (IOMUX_PINCM27)
/* Port definition for Pin Group GPIO_MOTOR_IN2 */
#define GPIO_MOTOR_IN2_PORT                                              (GPIOB)

/* Defines for AIN2: GPIOB.12 with pinCMx 29 on package pin 64 */
#define GPIO_MOTOR_IN2_AIN2_PIN                                 (DL_GPIO_PIN_12)
#define GPIO_MOTOR_IN2_AIN2_IOMUX                                (IOMUX_PINCM29)
/* Defines for BIN2: GPIOB.13 with pinCMx 30 on package pin 1 */
#define GPIO_MOTOR_IN2_BIN2_PIN                                 (DL_GPIO_PIN_13)
#define GPIO_MOTOR_IN2_BIN2_IOMUX                                (IOMUX_PINCM30)
/* Port definition for Pin Group GPIO_RGB */
#define GPIO_RGB_PORT                                                    (GPIOB)

/* Defines for LED_R: GPIOB.6 with pinCMx 23 on package pin 58 */
#define GPIO_RGB_LED_R_PIN                                       (DL_GPIO_PIN_6)
#define GPIO_RGB_LED_R_IOMUX                                     (IOMUX_PINCM23)
/* Defines for LED_G: GPIOB.7 with pinCMx 24 on package pin 59 */
#define GPIO_RGB_LED_G_PIN                                       (DL_GPIO_PIN_7)
#define GPIO_RGB_LED_G_IOMUX                                     (IOMUX_PINCM24)
/* Defines for LED_B: GPIOB.8 with pinCMx 25 on package pin 60 */
#define GPIO_RGB_LED_B_PIN                                       (DL_GPIO_PIN_8)
#define GPIO_RGB_LED_B_IOMUX                                     (IOMUX_PINCM25)
/* Port definition for Pin Group GPIO_EC11 */
#define GPIO_EC11_PORT                                                   (GPIOA)

/* Defines for GPIO_EC11_KEY: GPIOA.16 with pinCMx 38 on package pin 9 */
#define GPIO_EC11_GPIO_EC11_KEY_PIN                             (DL_GPIO_PIN_16)
#define GPIO_EC11_GPIO_EC11_KEY_IOMUX                            (IOMUX_PINCM38)
/* Defines for GPIO_EC11_S1: GPIOA.12 with pinCMx 34 on package pin 5 */
// pins affected by this interrupt request:["GPIO_EC11_S1","GPIO_EC11_S2"]
#define GPIO_EC11_INT_IRQN                                      (GPIOA_INT_IRQn)
#define GPIO_EC11_INT_IIDX                      (DL_INTERRUPT_GROUP1_IIDX_GPIOA)
#define GPIO_EC11_GPIO_EC11_S1_IIDX                         (DL_GPIO_IIDX_DIO12)
#define GPIO_EC11_GPIO_EC11_S1_PIN                              (DL_GPIO_PIN_12)
#define GPIO_EC11_GPIO_EC11_S1_IOMUX                             (IOMUX_PINCM34)
/* Defines for GPIO_EC11_S2: GPIOA.14 with pinCMx 36 on package pin 7 */
#define GPIO_EC11_GPIO_EC11_S2_IIDX                         (DL_GPIO_IIDX_DIO14)
#define GPIO_EC11_GPIO_EC11_S2_PIN                              (DL_GPIO_PIN_14)
#define GPIO_EC11_GPIO_EC11_S2_IOMUX                             (IOMUX_PINCM36)
/* Defines for PIN_En1: GPIOA.18 with pinCMx 40 on package pin 11 */
#define GPIO_Stepper1_PIN_En1_PORT                                       (GPIOA)
#define GPIO_Stepper1_PIN_En1_PIN                               (DL_GPIO_PIN_18)
#define GPIO_Stepper1_PIN_En1_IOMUX                              (IOMUX_PINCM40)
/* Defines for PIN_Dir1: GPIOB.17 with pinCMx 43 on package pin 14 */
#define GPIO_Stepper1_PIN_Dir1_PORT                                      (GPIOB)
#define GPIO_Stepper1_PIN_Dir1_PIN                              (DL_GPIO_PIN_17)
#define GPIO_Stepper1_PIN_Dir1_IOMUX                             (IOMUX_PINCM43)
/* Port definition for Pin Group GPIO_Stepper2 */
#define GPIO_Stepper2_PORT                                               (GPIOB)

/* Defines for PIN_En2: GPIOB.18 with pinCMx 44 on package pin 15 */
#define GPIO_Stepper2_PIN_En2_PIN                               (DL_GPIO_PIN_18)
#define GPIO_Stepper2_PIN_En2_IOMUX                              (IOMUX_PINCM44)
/* Defines for PIN_Dir2: GPIOB.19 with pinCMx 45 on package pin 16 */
#define GPIO_Stepper2_PIN_Dir2_PIN                              (DL_GPIO_PIN_19)
#define GPIO_Stepper2_PIN_Dir2_IOMUX                             (IOMUX_PINCM45)
/* Defines for PIN_Y8_CLK: GPIOA.22 with pinCMx 47 on package pin 18 */
#define GPIO_Y8_PIN_Y8_CLK_PORT                                          (GPIOA)
#define GPIO_Y8_PIN_Y8_CLK_PIN                                  (DL_GPIO_PIN_22)
#define GPIO_Y8_PIN_Y8_CLK_IOMUX                                 (IOMUX_PINCM47)
/* Defines for PIN_Y8_DAT: GPIOB.20 with pinCMx 48 on package pin 19 */
#define GPIO_Y8_PIN_Y8_DAT_PORT                                          (GPIOB)
#define GPIO_Y8_PIN_Y8_DAT_PIN                                  (DL_GPIO_PIN_20)
#define GPIO_Y8_PIN_Y8_DAT_IOMUX                                 (IOMUX_PINCM48)


/* clang-format on */

void SYSCFG_DL_init(void);
void SYSCFG_DL_initPower(void);
void SYSCFG_DL_GPIO_init(void);
void SYSCFG_DL_SYSCTL_init(void);
void SYSCFG_DL_PWM_MOTOR_PWM_init(void);
void SYSCFG_DL_PWM_Stepper1_init(void);
void SYSCFG_DL_PWM_Stepper2_init(void);
void SYSCFG_DL_PWM_Servo_init(void);
void SYSCFG_DL_TIMER_0_init(void);
void SYSCFG_DL_TIMER_1_init(void);
void SYSCFG_DL_TIMER_2_init(void);
void SYSCFG_DL_I2C_0_init(void);
void SYSCFG_DL_I2C_1_init(void);
void SYSCFG_DL_UART_0_init(void);
void SYSCFG_DL_UART_1_init(void);
void SYSCFG_DL_UART_2_init(void);
void SYSCFG_DL_UART_4_init(void);
void SYSCFG_DL_DMA_init(void);


bool SYSCFG_DL_saveConfiguration(void);
bool SYSCFG_DL_restoreConfiguration(void);

#ifdef __cplusplus
}
#endif

#endif /* ti_msp_dl_config_h */
